iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(200, "application/json", encoder.end());
    }

    void Web_Server::handle_esp_settings()
    {
        JSONencoder encoder;
        encoder.begin();
        encoder.begin_array("Settings");
        for (Setting *js = Setting::List; js; js = js->next())
        {
            if (js->getType() == WEBSET && js->getGrblName())
            {
                encoder.begin_object();
                encoder.member("Name", js->getGrblName());
                encoder.member("Value", js->getStringValue());
                encoder.end_object();
            }
        }
        encoder.end_array();
        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(200, "application/json", encoder.end().c_str());
    }

    void Web_Server::handle_grbl_settings()
    {
        JSONencoder encoder;
        encoder.begin();
        encoder.begin_array("Settings");
        for (Setting *s = Setting::List; s; s = s->next())
        {
            if (s->getType() == GRBL && s->getGrblName())
            {
                encoder.begin_object();
                encoder.member("Name", s->getGrblName());
                encoder.member("Value", s->getStringValue());
                encoder.end_object();
            }
        }
        encoder.end_array();
        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(200, "application/json", encoder.end().c_str());
    }

    // SPIFFS
    // SPIFFS files list and file commands
    void Web_Server::handleFileList()
    {
        String path;
        String status = JSONencoder::ok;
        if (_upload_status == UploadStatusType::FAILED)
        {
            status = "Upload failed";
            _upload_status = UploadStatusType::NONE;
        }
        _upload_status = UploadStatusType::NONE;

        // be sure root is correct according authentication
        path = "/";

        // get current path
        if (_webserver->hasArg("path"))
        {
            path += _webserver->arg("path");
        }

        // to have a clean path
        path.trim();
        path.replace("//", "/");
        if (path[path.length() - 1] != '/')
        {
            path += "/";
        }

        // check if query need some action
        if (_webserver->hasArg("action"))
        {
            // delete a file
            if (_webserver->arg("action") == "delete" && _webserver->hasArg("filename"))
            {
                String filename;
                String shortname = _webserver->arg("filename");
                shortname.replace("/", "");
                filename = path + _webserver->arg("filename");
                filename.replace("//", "/");
                if (!SPIFFS.exists(filename))
                {
                    status = shortname + " does not exists!";
                }
                else
                {
                    if (SPIFFS.remove(filename))
                    {
                        status = shortname + " deleted";
                        // what happen if no "/." and no other subfiles ?
                        String ptmp = path;
                        if ((path != "/") && (path[path.length() - 1] = '/'))
                        {
                            ptmp = path.substring(0, path.length() - 1);
                        }

                        File dir = SPIFFS.open(ptmp);
                        File dircontent = dir.openNextFile();
                        if (!dircontent)
                        {
                            // keep directory alive even empty
                            File r = SPIFFS.open(path + "/.", FILE_WRITE);
                            if (r)
                            {
                                r.close();
                            }
                        }
                    }
                    else
                    {
                        status = "Cannot deleted ";
                        status += shortname;
                    }
                }
            }
            // delete a directory
            if (_webserver->arg("action") == "deletedir" && _webserver->hasArg("filename"))
            {
                String filename;
                String shortname = _webserver->arg("filename");
                shortname.replace("/", "");
                filename = path + _webserver->arg("filename");
                filename += "/";
                filename.replace("//", "/");
                if (filename != "/")
                {
                    bool delete_error = false;
                    File dir = SPIFFS.open(path + shortname);
                    {
                        File file2deleted = dir.openNextFile();
                        while (file2deleted)
                        {
                            String fullpath = file2deleted.name();
                            if (!SPIFFS.remove(fullpath))
                            {
                                delete_error = true;
                                status = "Cannot deleted ";
                                status += fullpath;
                            }
                            file2deleted = dir.openNextFile();
                        }
                    }
                    if (!delete_error)
                    {
                        status = shortname;
                        status += " deleted";
                    }
                }
            }

            // create a directory
            if (_webserver->arg("action") == "createdir" && _webserver->hasArg("filename"))
            {
                String filename;
                filename = path + _webserver->arg("filename") + "/.";
                String shortname = _webserver->arg("filename");
                shortname.replace("/", "");
                filename.replace("//", "/");
                if (SPIFFS.exists(filename))
                {
                    status = shortname + " already exists!";
                }
                else
                {
                    File r = SPIFFS.open(filename, FILE_WRITE);
                    if (!r)
                    {
                        status = "Cannot create ";
                        status += shortname;
                    }
                    else
                    {
                        r.close();
                        status = shortname + " created";
                    }
                }
            }
        }

        String ptmp = path;
        if ((path != "/") && (path[path.length() - 1] = '/'))
        {
            ptmp = path.substring(0, path.length() - 1);
        }

