iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
        File dir = SPIFFS.open(ptmp);
        JSONencoder encoder;
        encoder.begin();
        encoder.begin_array("files");
        String subdirlist = "";
        File fileparsed = dir.openNextFile();
        while (fileparsed)
        {
            String filename = fileparsed.name();
            String size = "";
            bool addtolist = true;
            // remove path from name
            filename = filename.substring(path.length(), filename.length());
            // check if file or subfile
            if (filename.indexOf("/") > -1)
            {
                // Do not rely on "/." to define directory as SPIFFS upload won't create it but directly files
                // and no need to overload SPIFFS if not necessary to create "/." if no need
                // it will reduce SPIFFS available space so limit it to creation
                filename = filename.substring(0, filename.indexOf("/"));
                String tag = "*";
                tag += filename + "*";
                if (subdirlist.indexOf(tag) > -1 || filename.length() == 0)
                {                      // already in list
                    addtolist = false; // no need to add
                }
                else
                {
                    size = "-1"; // it is subfile so display only directory, size will be -1 to describe it is directory
                    if (subdirlist.length() == 0)
                    {
                        subdirlist += "*";
                    }
                    subdirlist += filename + "*"; // add to list
                }
            }
            else
            {
                // do not add "." file
                if (!((filename == ".") || (filename == "")))
                {
                    size = ESPResponseStream::formatBytes(fileparsed.size());
                }
                else
                {
                    addtolist = false;
                }
            }
            if (addtolist)
            {
                encoder.begin_object();
                encoder.member("name", filename);
                encoder.member("size", size);
                encoder.end_object();
            }
            fileparsed = dir.openNextFile();
        }
        encoder.end_array();
        encoder.member("path", path);
        encoder.member(JSONencoder::status, JSONencoder::ok);
        size_t totalBytes;
        size_t usedBytes;
        totalBytes = SPIFFS.totalBytes();
        usedBytes = SPIFFS.usedBytes();
        encoder.member("total", ESPResponseStream::formatBytes(totalBytes));
        encoder.member("used", ESPResponseStream::formatBytes(usedBytes));
        encoder.member("occupation", String(100 * usedBytes / totalBytes));
        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(200, "application/json", encoder.end());
    }

    // push error code and message to websocket
    void Web_Server::pushError(UploadError code, const char *st, bool web_error, uint16_t timeout)
    {
        if (_socket_server && st)
        {
            String s = "ERROR:" + String(static_cast<int>(code)) + ":";
            s += st;
            _socket_server->sendTXT(_id_connection, s);
            if (web_error != 0 && _webserver && _webserver->client().available() > 0)
            {
                sendStatus(web_error, s);
            }

            uint32_t t = millis();
            while (millis() - t < timeout)
            {
                _socket_server->loop();
                delay(10);
            }
        }
    }

    // abort reception of packages
    void Web_Server::cancelUpload()
    {
        if (_webserver && _webserver->client().available() > 0)
        {
            HTTPUpload &upload = _webserver->upload();
            upload.status = UPLOAD_FILE_ABORTED;
            errno = ECONNABORTED;
            _webserver->client().stop();
            delay(100);
        }
    }

    // SPIFFS files uploader handle
    void Web_Server::SPIFFSFileupload()
    {
        static String filename;
        static File fsUploadFile = (File)0;

        HTTPUpload &upload = _webserver->upload();
        if ((_upload_status != UploadStatusType::FAILED) || (upload.status == UPLOAD_FILE_START))
        {
            // Upload start
            //**************
            if (upload.status == UPLOAD_FILE_START)
            {
                _upload_status = UploadStatusType::ONGOING;
                String upload_filename = upload.filename;
                if (upload_filename[0] != '/')
                {
                    filename = "/" + upload_filename;
                }
                else
                {
                    filename = upload.filename;
                }

                if (SPIFFS.exists(filename))
                {
                    SPIFFS.remove(filename);
                }
                if (fsUploadFile)
                {
                    fsUploadFile.close();
                }
                String sizeargname = upload.filename + "S";
                if (_webserver->hasArg(sizeargname))
                {
                    uint32_t filesize = _webserver->arg(sizeargname).toInt();
                    uint32_t freespace = SPIFFS.totalBytes() - SPIFFS.usedBytes();
                    if (filesize > freespace)
                    {
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                        pushError(UploadError::ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space", 507);
                    }
                }

                if (_upload_status != UploadStatusType::FAILED)
                {
                    // create file
                    fsUploadFile = SPIFFS.open(filename, FILE_WRITE);
                    // check If creation succeed
                    if (fsUploadFile)
                    {
                        // if yes upload is started
                        _upload_status = UploadStatusType::ONGOING;
                    }
                    else
                    {
                        // if no set cancel flag
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                        pushError(UploadError::ESP_ERROR_FILE_CREATION, "File creation failed", 500);
                    }
                }
                // Upload write
                //**************
            }
            else if (upload.status == UPLOAD_FILE_WRITE)
            {
                vTaskDelay(1 / portTICK_RATE_MS);
                // check if file is available and no error
                if (fsUploadFile && _upload_status == UploadStatusType::ONGOING)
                {
                    // no error so write post date
                    if (upload.currentSize != fsUploadFile.write(upload.buf, upload.currentSize))
                    {
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                        pushError(UploadError::ESP_ERROR_FILE_WRITE, "File write failed", 500);
                    }
                }
                else
                {
                    // we have a problem set flag UploadStatusType::FAILED
                    _upload_status = UploadStatusType::FAILED;
                    grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                    pushError(UploadError::ESP_ERROR_FILE_WRITE, "File write failed", 500);
                }
                // Upload end
                //**************
            }
            else if (upload.status == UPLOAD_FILE_END)
            {
                // check if file is still open
                if (fsUploadFile)
                {
                    // close it
                    fsUploadFile.close();
                    // check size
                    String sizeargname = upload.filename + "S";
                    fsUploadFile = SPIFFS.open(filename, FILE_READ);
                    uint32_t filesize = fsUploadFile.size();
                    fsUploadFile.close();

                    if (_webserver->hasArg(sizeargname) && _webserver->arg(sizeargname) != String(filesize))
                    {
                        _upload_status = UploadStatusType::FAILED;
                    }

