iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
                    if (_upload_status == UploadStatusType::ONGOING)
                    {
                        _upload_status = UploadStatusType::SUCCESSFUL;
                    }
                    else
                    {
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                        pushError(UploadError::ESP_ERROR_UPLOAD, "File upload failed", 500);
                    }
                }
                else
                {
                    // we have a problem set flag UploadStatusType::FAILED
                    _upload_status = UploadStatusType::FAILED;
                    pushError(UploadError::ESP_ERROR_FILE_CLOSE, "File close failed", 500);
                    grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                }
                // Upload cancelled
                //**************
            }
            else
            {
                _upload_status = UploadStatusType::FAILED;
                // pushError(ESP_ERROR_UPLOAD, "File upload failed");
                return;
            }
        }

        if (_upload_status == UploadStatusType::FAILED)
        {
            cancelUpload();
            if (SPIFFS.exists(filename))
            {
                SPIFFS.remove(filename);
            }
        }
        COMMANDS::wait(0);
    }

    // Web Update handler
    void Web_Server::handleUpdate()
    {
        sendStatus(200, String(uint8_t(_upload_status)));

        // if success restart
        if (_upload_status == UploadStatusType::SUCCESSFUL)
        {
            COMMANDS::wait(1000);
            COMMANDS::restart_ESP();
        }
        else
        {
            _upload_status = UploadStatusType::NONE;
        }
    }

    // File upload for Web update
    void Web_Server::WebUpdateUpload()
    {
        static size_t last_upload_update;
        static uint32_t maxSketchSpace = 0;

        // get current file ID
        HTTPUpload &upload = _webserver->upload();
        if ((_upload_status != UploadStatusType::FAILED) || (upload.status == UPLOAD_FILE_START))
        {
            // Upload start
            //**************
            if (upload.status == UPLOAD_FILE_START)
            {
                grbl_send(CLIENT_ALL, "[MSG:Update Firmware]\r\n");
                _upload_status = UploadStatusType::ONGOING;
                String sizeargname = upload.filename + "S";
                if (_webserver->hasArg(sizeargname))
                {
                    maxSketchSpace = _webserver->arg(sizeargname).toInt();
                }
                // check space
                size_t flashsize = 0;
                if (esp_ota_get_running_partition())
                {
                    const esp_partition_t *partition = esp_ota_get_next_update_partition(NULL);
                    if (partition)
                    {
                        flashsize = partition->size;
                    }
                }
                if (flashsize < maxSketchSpace)
                {
                    pushError(UploadError::ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space", 507);
                    _upload_status = UploadStatusType::FAILED;
                    grbl_send(CLIENT_ALL, "[MSG:Update cancelled]\r\n");
                }
                if (_upload_status != UploadStatusType::FAILED)
                {
                    last_upload_update = 0;
                    if (!Update.begin())
                    { // start with max available size
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Update cancelled]\r\n");
                        pushError(UploadError::ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space", 507);
                    }
                    else
                    {
                        grbl_send(CLIENT_ALL, "\n[MSG:Update 0%]\r\n");
                    }
                }
                // Upload write
                //**************
            }
            else if (upload.status == UPLOAD_FILE_WRITE)
            {
                vTaskDelay(1 / portTICK_RATE_MS);
                // check if no error
                if (_upload_status == UploadStatusType::ONGOING)
                {
                    if (((100 * upload.totalSize) / maxSketchSpace) != last_upload_update)
                    {
                        if (maxSketchSpace > 0)
                        {
                            last_upload_update = (100 * upload.totalSize) / maxSketchSpace;
                        }
                        else
                        {
                            last_upload_update = upload.totalSize;
                        }

                        String s = "Update ";
                        s += String(last_upload_update);
                        s += "%";
                        grbl_sendf(CLIENT_ALL, "[MSG:%s]\r\n", s.c_str());
                    }
                    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize)
                    {
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Update write failed]\r\n");
                        pushError(UploadError::ESP_ERROR_FILE_WRITE, "File write failed", 500);
                    }
                }
                // Upload end
                //**************
            }
            else if (upload.status == UPLOAD_FILE_END)
            {
                if (Update.end(true))
                { // true to set the size to the current progress
                    // Now Reboot
                    grbl_send(CLIENT_ALL, "[MSG:Update 100%]\r\n");
                    _upload_status = UploadStatusType::SUCCESSFUL;
                }
                else
                {
                    _upload_status = UploadStatusType::FAILED;
                    grbl_send(CLIENT_ALL, "[MSG:Update failed]\r\n");
                    pushError(UploadError::ESP_ERROR_UPLOAD, "Update upload failed", 500);
                }
            }
            else if (upload.status == UPLOAD_FILE_ABORTED)
            {
                grbl_send(CLIENT_ALL, "[MSG:Update failed]\r\n");
                _upload_status = UploadStatusType::FAILED;
                return;
            }
        }

