iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
        if (_upload_status == UploadStatusType::FAILED)
        {
            cancelUpload();
            Update.end();
        }

        COMMANDS::wait(0);
    }

#ifdef ENABLE_SD_CARD

    // Function to delete not empty directory on SD card
    bool Web_Server::deleteRecursive(String path)
    {
        bool result = true;
        File file = SD.open(path);
        // failed
        if (!file)
        {
            return false;
        }
        if (!file.isDirectory())
        {
            file.close();
            // return if success or not
            return SD.remove(path);
        }
        file.rewindDirectory();
        while (true)
        {
            File entry = file.openNextFile();
            if (!entry)
            {
                break;
            }
            String entryPath = entry.name();
            if (entry.isDirectory())
            {
                entry.close();
                if (!deleteRecursive(entryPath))
                {
                    result = false;
                }
            }
            else
            {
                entry.close();
                if (!SD.remove(entryPath))
                {
                    result = false;
                    break;
                }
            }
            COMMANDS::wait(0); // wdtFeed
        }
        file.close();
        return result ? SD.rmdir(path) : false;
    }

    // direct SD files list//////////////////////////////////////////////////
    void Web_Server::handle_direct_SDFileList()
    {
        String path = "/";
        String sstatus = JSONencoder::ok;
        if ((_upload_status == UploadStatusType::FAILED) || (_upload_status == UploadStatusType::FAILED))
        {
            sstatus = "Upload failed";
        }
        _upload_status = UploadStatusType::NONE;
        bool list_files = true;
        uint64_t totalspace = 0;
        uint64_t usedspace = 0;
        SDState state = get_sd_state(true);
        if (state != SDState::Idle)
        {
            sendStatus(200, state == SDState::NotPresent ? "No SD Card" : "Busy");
            return;
        }
        set_sd_state(SDState::BusyParsing);

        // get current path
        if (_webserver->hasArg("path"))
        {
            path += _webserver->arg("path");
        }

        // to have a clean path
        path.trim();
        path.replace("//", "/");
        if (path[path.length() - 1] != '/')
        {
            path += "/";
        }
        // check if query need some action
        if (_webserver->hasArg("action"))
        {
            // delete a file
            if (_webserver->arg("action") == "delete" && _webserver->hasArg("filename"))
            {
                String filename;
                String shortname = _webserver->arg("filename");
                filename = path + shortname;
                shortname.replace("/", "");
                filename.replace("//", "/");
                grbl_msg_sendf(CLIENT_ALL, MsgLevel::Info, filename.c_str());
                if (!SD.exists(filename))
                {
                    sstatus = shortname + " does not exist!";
                }
                else
                {
                    if (SD.remove(filename))
                    {
                        sstatus = shortname + " deleted";
                    }
                    else
                    {
                        sstatus = "Cannot deleted ";
                        sstatus += shortname;
                    }
                }
            }
            // delete a directory
            if (_webserver->arg("action") == "deletedir" && _webserver->hasArg("filename"))
            {
                String filename;
                String shortname = _webserver->arg("filename");
                shortname.replace("/", "");
                filename = path + "/" + shortname;
                filename.replace("//", "/");
                if (filename != "/")
                {
                    if (!SD.exists(filename))
                    {
                        sstatus = shortname + " does not exist!";
                    }
                    else
                    {
                        if (!deleteRecursive(filename))
                        {
                            sstatus = "Error deleting: ";
                            sstatus += shortname;
                        }
                        else
                        {
                            sstatus = shortname;
                            sstatus += " deleted";
                        }
                    }
                }
                else
                {
                    sstatus = "Cannot delete root";
                }
            }
            // create a directory
            if (_webserver->arg("action") == "createdir" && _webserver->hasArg("filename"))
            {
                String filename;
                String shortname = _webserver->arg("filename");
                filename = path + shortname;
                shortname.replace("/", "");
                filename.replace("//", "/");
                if (SD.exists(filename))
                {
                    sstatus = shortname + " already exists!";
                }
                else
                {
                    if (!SD.mkdir(filename))
                    {
                        sstatus = "Cannot create ";
                        sstatus += shortname;
                    }
                    else
                    {
                        sstatus = shortname + " created";
                    }
                }
            }
        }
        // check if no need build file list
        if (_webserver->hasArg("dontlist") && _webserver->arg("dontlist") == "yes")
        {
            list_files = false;
        }

        JSONencoder encoder;
        encoder.begin();
        encoder.begin_array("files");
        if (path != "/")
        {
            path = path.substring(0, path.length() - 1);
        }

        if (path != "/" && !SD.exists(path))
        {
            sendStatus(404, path + "does not exist on SD Card");
            SD.end();
            set_sd_state(SDState::Idle);
            return;
        }
        if (list_files)
        {
            File dir = SD.open(path);
            if (!dir.isDirectory())
            {
                dir.close();
            }
            dir.rewindDirectory();
            File entry = dir.openNextFile();
            while (entry)
            {
                COMMANDS::wait(1);
                String tmpname = entry.name();
                int pos = tmpname.lastIndexOf("/");
                tmpname = tmpname.substring(pos + 1);
                encoder.begin_object();
                encoder.member("name", tmpname);
                encoder.member("shortname", tmpname);
                if (entry.isDirectory())
                {
                    encoder.member("size", "-1");
                }
                else
                {
                    // files have sizes, directories do not
                    encoder.member("size", ESPResponseStream::formatBytes(entry.size()));
                }
                encoder.member("datetime", "");
                encoder.end_object();
                entry.close();
                entry = dir.openNextFile();
            }
            dir.close();
        }
        encoder.end_array();
        encoder.member("path", path);
        String stotalspace, susedspace;
        // SDCard are in GB or MB but no less
        totalspace = SD.totalBytes();
        usedspace = SD.usedBytes();
        stotalspace = ESPResponseStream::formatBytes(totalspace);
        susedspace = ESPResponseStream::formatBytes(usedspace + 1);

