iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
        if (_upload_status == UploadStatusType::FAILED)
        {
            cancelUpload();
            if (sdUploadFile)
            {
                sdUploadFile.close();
            }
            if (SD.exists(filename))
            {
                SD.remove(filename);
            }
            set_sd_state(SDState::Idle);
        }
        COMMANDS::wait(0);
    }
#endif

    void Web_Server::handle()
    {
        static uint32_t timeout = millis();
        COMMANDS::wait(0);
#ifdef ENABLE_CAPTIVE_PORTAL
        if (WiFi.getMode() == WIFI_AP)
        {
            dnsServer.processNextRequest();
        }
#endif
        if (_webserver)
        {
            _webserver->handleClient();
        }
        if (_socket_server && _setupdone)
        {
            _socket_server->loop();
        }
        if ((millis() - timeout) > 10000 && _socket_server)
        {
            String s = "PING:";
            s += String(_id_connection);
            _socket_server->broadcastTXT(s);
            timeout = millis();
        }
    }

    void Web_Server::handle_Websocket_Event(uint8_t num, uint8_t type, uint8_t *payload, size_t length)
    {
        switch (type)
        {
        case WStype_DISCONNECTED:
            // USE_SERIAL.printf("[%u] Disconnected!\n", num);
            grbl_send(CLIENT_SERIAL, "WebUI Disconnected!\n");
            break;
        case WStype_CONNECTED:
        {
            IPAddress ip = _socket_server->remoteIP(num);
            // USE_SERIAL.printf("[%u] Connected from %d.%d.%d.%d url: %s\n", num, ip[0], ip[1], ip[2], ip[3], payload);
            String s = "CURRENT_ID:" + String(num);
            // send message to client
            _id_connection = num;
            _socket_server->sendTXT(_id_connection, s);
            s = "ACTIVE_ID:" + String(_id_connection);
            _socket_server->broadcastTXT(s);

            grbl_send(CLIENT_SERIAL, "WebUI connected!\n");
        }
        break;
        case WStype_TEXT:
            // USE_SERIAL.printf("[%u] get Text: %s\n", num, payload);

            // send message to client
            _socket_server->sendTXT(_id_connection, "got it");

            // send data to all connected clients
            // webSocket.broadcastTXT("message here");
            break;
        case WStype_BIN:
            // USE_SERIAL.printf("[%u] get binary length: %u\n", num, length);
            // hexdump(payload, length);

            // send message to client
            // webSocket.sendBIN(num, payload, length);
            break;
        default:
            break;
        }
    }

    // The separator that is passed in to this function is always '\n'
    // The string that is returned does not contain the separator
    // The calling code adds back the separator, unless the string is
    // a one-character realtime command.
    String Web_Server::get_Splited_Value(String data, char separator, int index)
    {
        int found = 0;
        int strIndex[] = {0, -1};
        int maxIndex = data.length() - 1;

        for (int i = 0; i <= maxIndex && found <= index; i++)
        {
            if (data.charAt(i) == separator || i == maxIndex)
            {
                found++;
                strIndex[0] = strIndex[1] + 1;
                strIndex[1] = (i == maxIndex) ? i + 1 : i;
            }
        }

        return found > index ? data.substring(strIndex[0], strIndex[1]) : "";
    }

    // helper to extract content type from file extension
    // Check what is the content tye according extension file
    String Web_Server::getContentType(String filename)
    {
        String file_name = filename;
        file_name.toLowerCase();
        if (filename.endsWith(".htm"))
        {
            return "text/html";
        }
        else if (file_name.endsWith(".html"))
        {
            return "text/html";
        }
        else if (file_name.endsWith(".css"))
        {
            return "text/css";
        }
        else if (file_name.endsWith(".js"))
        {
            return "application/javascript";
        }
        else if (file_name.endsWith(".png"))
        {
            return "image/png";
        }
        else if (file_name.endsWith(".gif"))
        {
            return "image/gif";
        }
        else if (file_name.endsWith(".jpeg"))
        {
            return "image/jpeg";
        }
        else if (file_name.endsWith(".jpg"))
        {
            return "image/jpeg";
        }
        else if (file_name.endsWith(".ico"))
        {
            return "image/x-icon";
        }
        else if (file_name.endsWith(".xml"))
        {
            return "text/xml";
        }
        else if (file_name.endsWith(".pdf"))
        {
            return "application/x-pdf";
        }
        else if (file_name.endsWith(".zip"))
        {
            return "application/x-zip";
        }
        else if (file_name.endsWith(".gz"))
        {
            return "application/x-gzip";
        }
        else if (file_name.endsWith(".txt"))
        {
            return "text/plain";
        }
        return "application/octet-stream";
    }

    // push error code and message to websocket
    void Web_Server::sendStatus(int httpCode, String status)
    {
        JSONencoder encoder;
        encoder.begin();
        encoder.member(JSONencoder::status, status);
        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(httpCode, "application/json", encoder.end());
    }
}
#endif // Enable HTTP && ENABLE_WIFI
